#include<stdio.h>
int main(int argc, char *argv[])
{
    //二维数组在计算机内部的存储是行存储
    int nums[3][3] = { 1, 2, 3, 4, 5, 6, 7, 8, 9 };
    printf("%d\n", nums[1][-2] );        //2
    //nums[1][-2] 可以看作 nums[1][0] 往左挪2个位置 = nums[0][1] = 2
    printf("%d\n", (-1)[nums][5] );      //3
    //(-1)[nums][5] = nums[-1][5] = *(*(nums-1)+5) = 3
    printf("%d\n", -1[nums][5] );        //-9
    //同理：-(1)nums[5] = -nums[1][5] = -nums[2][2] = -9
    return 0;
}
//          也可以这样计算a[i][j]的值
//假设数组是a[N][M]，按行优先存储   则a[i][j] = a[i*m+j]
//为什么可以这样计算呢？
//这是因为按行优先存储，可以当做一维数组来看，第i行说明前i行所有的元素全满，为i*M个
//在第i行里面，找的是第j个元素，所以和之前的一相加就可以了
