#include <stdio.h>
#include<string.h>
int main(int argc, char *argv[])
{
    // 默认为sign char
    char str[512];
    int i;
    for (i = 0; i < 512; ++i)
    {		
        str[i] = -1 - i;
    }
    // 无符号长整型
    printf("%lu\n", strlen(str));
    return 0;
}

/*
***********负数在计算机中以补码的方式存储****************
    1.-1的源码   1000 0000 0000 0000 0000 0000 0000 0001
      -1的补码   1111 1111 1111 1111 1111 1111 1111 1111
      char型数组，取一个字节，从低字节开始  1111 1110
      256的源码  0000 0000 0000 0000 0000 0001 0000 0000
      256的补码  1111 1111 1111 1111 1111 1111 0000 0000
      char型数组，取一个字节，从低字节开始  0000 0000
      str[256]的十进制数为0，转化为char类型就是'\0'.
      所以结果为 255
*/
